[
  {
    "roomNumber": "201",
    "type": "Deluxe Queen Room",
    "capacity": 3,
    "adults": 2,
    "child": 1,
    "beds": {
      "single": 1,
      "double": 1
    },
    "description": "Experience luxury in our Deluxe Queen Room, featuring a private balcony with breathtaking ocean views. Designed for comfort, this room is perfect for couples or small families seeking relaxation in a serene environment. Enjoy modern amenities like high-speed Wi-Fi, flat-screen TV, and air conditioning. The room offers a cozy ambiance with a queen-sized bed and a single bed, making it ideal for a family of three. Wake up to the sound of the waves and unwind with the stunning coastal scenery from your balcony. Book this room for a memorable, luxurious stay by the ocean.",
    "amenities": ["wifi", "TV", "AC", "private balcony with ocean view"],
    "price": 150.0,
    "availability": {
      "startDate": "2023-01-01",
      "endDate": "2023-12-31"
    },
    "cancellationPolicy": "Free Cancellation",
    "checkInTime": "11:00 PM",
    "checkOutTime": "11:00 PM",
    "image": "https://i.ibb.co/3W5C9fp/1.jpg",
    "gallery": [
      "https://i.ibb.co.com/YZtp9pq/001.jpg",
      "https://i.ibb.co.com/QXs3tXT/01.jpg",
      "https://i.ibb.co.com/m4zv97L/0001.jpg"
    ]
  },
  {
    "roomNumber": "301",
    "type": "King Ensuite Room",
    "capacity": 4,
    "adults": 2,
    "child": 2,
    "beds": {
      "single": 0,
      "double": 2
    },
    "description": " Indulge in ultimate luxury with our King Ensuite Room, designed for those who seek a premium experience. The spacious room features a king-sized bed, two double beds, and a private spa for relaxation. Ideal for families or couples, the room comes equipped with modern amenities such as high-speed Wi-Fi, a flat-screen TV, and air conditioning. Relax in the comfort of your own private space with a minibar stocked for your convenience. Whether you're traveling for leisure or business, this room provides the perfect blend of luxury and comfort to elevate your stay.",
    "amenities": ["wifi", "TV", "AC"],
    "price": 250.0,
    "availability": {
      "startDate": "2023-01-01",
      "endDate": "2023-12-31"
    },
    "cancellationPolicy": "Free Cancellation",
    "checkInTime": "11:00 PM",
    "checkOutTime": "11:00 PM",
    "image": "https://i.ibb.co/jVzpTNn/2.jpg",
    "gallery": [
      "https://i.ibb.co.com/Lg1vB2s/002.jpg",
      "https://i.ibb.co.com/gyqT4BC/0002.jpg",
      "https://ibb.co.com/pZjRrs5"
    ]
  },
  {
    "roomNumber": "102",
    "type": "Family",
    "capacity": 6,
    "adults": 4,
    "child": 2,
    "beds": {
      "single": 2,
      "double": 2
    },
    "description": "Our Family Room is designed to provide a spacious, comfortable stay for large families. With connecting rooms and enough space for six people, this room ensures that everyone has their own area while remaining close together. It comes equipped with two single beds and two double beds, offering flexibility for families. Amenities like free Wi-Fi, a flat-screen TV, and air conditioning ensure a modern, comfortable experience. The Family Room is perfect for creating lasting memories with loved ones, providing both privacy and shared space in a welcoming and warm environment.",
    "amenities": ["free wifi", "TV", "air conditioning", "connecting rooms"],
    "price": 120.0,
    "availability": {
      "startDate": "2023-01-01",
      "endDate": "2023-12-31"
    },
    "cancellationPolicy": "Free Cancellation",
    "image": "https://i.ibb.co/Sr95bsX/3.jpg",
    "gallery": [
      "https://i.ibb.co.com/qYh1fFd/03.jpg",
      "https://i.ibb.co.com/HHnnc7p/003.jpg",
      "https://ibb.co.com/xHRXWCS"
    ]
  },
  {
    "roomNumber": "115",
    "type": "Standard Room",
    "capacity": 2,
    "adults": 2,
    "child": 0,
    "beds": {
      "single": 0,
      "double": 1
    },
    "description": "Experience comfort and affordability in our Standard Room, ideal for budget-conscious travelers without compromising on essential amenities. This cozy room is perfect for two adults and features a comfortable double bed, air conditioning, a flat-screen TV, and free Wi-Fi. Whether you're staying for a short weekend getaway or an extended business trip, our Standard Room provides all the essentials for a restful stay. Enjoy a relaxing environment that caters to your basic needs, with everything you require to recharge during your trip at an affordable price point.",
    "amenities": ["wifi", "TV", "AC"],
    "price": 80.0,
    "availability": {
      "startDate": "2023-01-01",
      "endDate": "2023-12-31"
    },
    "cancellationPolicy": "Free Cancellation",
    "checkInTime": "11:00 PM",
    "checkOutTime": "11:00 PM",
    "image": "https://i.ibb.co/RhBZGfb/4.jpg",
    "gallery": [
      "https://i.ibb.co.com/dp235Cc/04.jpg",
      "https://i.ibb.co.com/Fh44wtn/004.jpg",
      "https://ibb.co.com/9whMNDQ"
    ]
  },
  {
    "roomNumber": "401",
    "type": "Romantic Suite",
    "capacity": 2,
    "adults": 2,
    "child": 0,
    "beds": {
      "single": 0,
      "double": 1
    },
    "description": "Perfect for couples, our Romantic Suite is the ideal choice for a romantic escape. Featuring a luxurious whirlpool tub and personalized rose petal turn-down service, this room sets the stage for intimate and unforgettable moments. The suite is equipped with modern amenities, including free Wi-Fi, air conditioning, and a flat-screen TV. Enjoy quiet relaxation and create beautiful memories in this peaceful and stylish space designed to enhance your romantic experience. Whether it's for an anniversary, honeymoon, or a special getaway, the Romantic Suite offers the ultimate ambiance for couples.",
    "amenities": [
      "free wifi",
      "TV",
      "air conditioning",
      "whirlpool tub",
      "rose petal turn-down service"
    ],
    "price": 200.0,
    "availability": {
      "startDate": "2023-01-01",
      "endDate": "2023-12-31"
    },
    "cancellationPolicy": "Free Cancellation",
    "checkInTime": "11:00 PM",
    "checkOutTime": "11:00 PM",
    "image": "https://i.ibb.co/ZcGFk87/5.jpg",
    "gallery": [
      "https://i.ibb.co/ZcGFk87/5.jpg",
      "https://ibb.co.com/QfWyk4T",
      "https://ibb.co.com/44KX5T3"
    ]
  },
  {
    "roomNumber": "118",
    "type": "Accessible",
    "capacity": 2,
    "adults": 2,
    "child": 0,
    "beds": {
      "single": 0,
      "double": 1
    },
    "description": "Our Accessible Room is specially designed to ensure comfort and convenience for all guests, including those with mobility challenges. This room is equipped with an accessible bathroom, free Wi-Fi, air conditioning, and a flat-screen TV. The spacious design ensures ease of movement, and all key amenities are within convenient reach. The room features a comfortable double bed, ensuring a restful stay. Whether you're traveling for leisure or business, this room is the perfect choice for guests seeking an accessible and comfortable accommodation option that provides both functionality and relaxation.",
    "amenities": ["free wifi", "TV", "air conditioning", "accessible bathroom"],
    "price": 90.0,
    "availability": {
      "startDate": "2023-01-01",
      "endDate": "2023-12-31"
    },
    "cancellationPolicy": "Free Cancellation",
    "checkInTime": "11:00 PM",
    "checkOutTime": "11:00 PM",
    "image": "https://i.ibb.co/4RmLRhs/6.jpg",
    "gallery": [
      "https://i.ibb.co/4RmLRhs/6.jpg",
      "https://i.ibb.co.com/zm3dsVZ/06.webp",
      "https://i.ibb.co.com/VqxT42K/006.jpg"
    ]
  }
]
